package com.example.dhikr_allah;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;

import java.util.ArrayList;

public class StandarActivity extends AppCompatActivity {

    private RecyclerView douaeRecView;
    private DouaeRecViewAdapter adapter;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_standar);

        adapter=new DouaeRecViewAdapter(this);
        douaeRecView = findViewById(R.id.douaeRecView);
        douaeRecView.setAdapter(adapter);
        douaeRecView.setLayoutManager(new LinearLayoutManager(this));

        ArrayList<Douae> sobhDouaes = new ArrayList<>();
        sobhDouaes.add(new Douae(1,"﴿اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾","1"));
        sobhDouaes.add(new Douae(2,"﴿قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَد﴾ٌۢ","3"));
        sobhDouaes.add(new Douae(3,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾","3"));
        sobhDouaes.add(new Douae(4,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ﴾","3"));
        sobhDouaes.add(new Douae(5,"أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.","1"));
        sobhDouaes.add(new Douae(11,"بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.","3"));
        sobhDouaes.add(new Douae(14,"سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.","3"));
        sobhDouaes.add(new Douae(12,"اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.","1"));
        sobhDouaes.add(new Douae(10,"حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ","7"));
        sobhDouaes.add(new Douae(17,"اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.","1"));
        sobhDouaes.add(new Douae(18,"يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ","3"));
        sobhDouaes.add(new Douae(6,"اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .","1"));
        sobhDouaes.add(new Douae(7,"رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ","3"));
        sobhDouaes.add(new Douae(8,"اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.","4"));
        sobhDouaes.add(new Douae(9,"اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.","1"));
        sobhDouaes.add(new Douae(13,"أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.","1"));
        sobhDouaes.add(new Douae(15,"يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.","3"));
        sobhDouaes.add(new Douae(19,"اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي","1"));
        sobhDouaes.add(new Douae(20,"اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.","3"));
        sobhDouaes.add(new Douae(21,"اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ","1"));

        ArrayList<Douae> masaDouaes = new ArrayList<>();
        masaDouaes.add(new Douae(1,"﴿اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾","1"));
        masaDouaes.add(new Douae(5,"﴿آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾","1"));
        masaDouaes.add(new Douae(2,"﴿قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ﴾","3"));
        masaDouaes.add(new Douae(3,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾","3"));
        masaDouaes.add(new Douae(4,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ﴾","3"));
        masaDouaes.add(new Douae(6,"أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.","1"));
        masaDouaes.add(new Douae(6,"اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.","1"));
        masaDouaes.add(new Douae(7,"اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.","3"));
        masaDouaes.add(new Douae(8,"رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.","3"));
        masaDouaes.add(new Douae(9,"بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم","3"));
        masaDouaes.add(new Douae(10,"سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. ","3"));
        masaDouaes.add(new Douae(11,"اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.","1"));
        masaDouaes.add(new Douae(12,"أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.","1"));
        masaDouaes.add(new Douae(13,"يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.","3"));
        masaDouaes.add(new Douae(14,"اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.","1"));
        masaDouaes.add(new Douae(15,"يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.","3"));
        masaDouaes.add(new Douae(16,"اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.","3"));
        masaDouaes.add(new Douae(17,"اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. ","1"));
        masaDouaes.add(new Douae(18,"أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.","3"));

        ArrayList<Douae> nawmDouaes = new ArrayList<>();
        nawmDouaes.add(new Douae(1,"﴿اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾","1"));
        nawmDouaes.add(new Douae(5,"﴿آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾","1"));
        nawmDouaes.add(new Douae(2,"﴿قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ﴾","3"));
        nawmDouaes.add(new Douae(3,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾","3"));
        nawmDouaes.add(new Douae(4,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ﴾","3"));
        nawmDouaes.add(new Douae(7,"لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.","10"));
        nawmDouaes.add(new Douae(6,"بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. ","1"));
        nawmDouaes.add(new Douae(8,"الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ،الرَّحْمـنِ الرَّحِيمِ،مَالِكِ يَوْمِ الدِّينِ،إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ،اهدِنَــــا الصِّرَاطَ المُستَقِيمَ،صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ","3"));

        ArrayList<Douae> salatDouaes = new ArrayList<>();
        salatDouaes.add(new Douae(1,"﴿اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾","1"));
        salatDouaes.add(new Douae(2,"﴿ قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ﴾","3"));
        salatDouaes.add(new Douae(3,"﴿ قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾","3"));
        salatDouaes.add(new Douae(4,"﴿قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ﴾","3"));
        salatDouaes.add(new Douae(5,"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.","1"));
        salatDouaes.add(new Douae(6,"أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.\n" +
                "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام . ","1"));
        salatDouaes.add(new Douae(7,"لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.","10"));
        salatDouaes.add(new Douae(8,"سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر. ","33"));
        salatDouaes.add(new Douae(9,"اللَّهُمَّ أَجِرْنِي مِنْ النَّار.","7"));

        ArrayList<Douae> aibar = new ArrayList<>();
        aibar.add(new Douae(6,"{الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ} [الرعد : 28]\n" +
                "\n" +
                "مهما كانت أوجاعهم ومهما اشتدت آلامهم وجراحهم ، فقلوبهم تسعد وتطمئن بذكر الله ..فالقلب الذي يسقى بذكر الله سوف يروى بنبع الإطمئنان ..\n" +
                "في القلوب طيش لايسكنه إلا ذكر الله .. تطيب القلوب وتركن بالقرب من الله وتسكن عند ذكره وترضى به مولى ونصيرا .. يامن أصابك الهم وأردت الفرح والطمأنينة ..اعلم ان ذكر الله سرور النفوس وأنسها ..روح الحياة وبهجتها .. ونور القلوب وثباتها . القلب يتغذى بذكر الله ، وبدون الذكر تستحكم الغفله ويزداد الشقاء .. وإن ذكرت الله ولم تجد الطمأنينة فذلك لأن اللسان يذكر والقلب غافل ، والجزاء من جنس العمل ..\n" +
                "قارىء القرآن لايشكو هما ولاغما ولا ضيقا، وقلبه مطمئن.. عندما يعترضك أمر اسكن روعك بالقرآن فالذي خلقك أعلم بما يناسب راحة قلبك فقال (ألا بذكر الله تطمئن القلوب) لو صار قلبك مرتعا للقلق وغشيته سحابة من هموم ، فالذكر روضة حانية تخرج منها مطمئنا منعما .. استفتح يومك بذكر الله تشعر بقربك من ربك وتفتح لك أبواب الخير والعطاء .. فما أسعد قلوب الذاكرين والذاكرات ..",""));

        aibar.add(new Douae(5,"{إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا} [الأحزاب : 56]\n" +
                "\n" +
                "بدأ الله تعالى العظيم بالصلاة على رسول الله صلى الله عليه وسلم ، والملائكة تابعت ، وأمر بذلك المؤمنين ...\n" +
                "أخبر الله تعالى بمنزلة نبيه بالملأ الأعلى ، ثم أمر أهل العالم السفلي بالصلاة عليه .. كم في هذا من شرف وعظيم منزلة لنبينا محمد صلى الله عليه وسلم ! والحق يقول(ورفعنا لك ذكرك) تأمل ياعزيزي كلمة يصلون فهي فعل مضارع يدل على الاستمرار ؟ إذا كان الله تعالى وملائكته يصلون على النبي باستمرار .. فعجبا لألسنتنا كيف تهدأ عن الصلاة عليه !!! ألف الصلاة والسلام عليك ياسيدي يارسول الله ...\n" +
                "قال رسول الله صلى الله عليه وسلم ( من صلى علي صلاة صلى الله عليه بها عشرا ) ومن منا لايتمنى ان يصلي الله عليه ؟... وقال(الْبَخِيلُ مَنْ ذُكِرْتُ عِنْدَهُ ثُمَّ لَمْ يُصَلِّ عَلَيّ) لاتكن بخيلا وكن مع الملأ الأعلى .. شاركهم شرف الصلاة على رسول الله .. واعلم أنك بالصلاة عليه تكفى همك .. اللهم نشهدك أننا نحب رسولنا الكريم فاحشرنا تحت لوائه واسقنا من حوضه الشريف واجمعنا معه في الفردوس ..",""));

        aibar.add(new Douae(8,"{فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ} [البقرة : 152]\n" +
                "\n" +
                "هل ترغب ان يدوي ذكرك في الملأ الأعلى ؟ ليس بينك وبين ذلك إلا أن تذكر الله فقط ، فأي معنى لزمن لم يذكرك الله فيه ! ..اللهم لاتجعلنا من الغافلين عن ذكرك ..\n" +
                "لنقف عند هذه الآية ولا نعجل ، فلو استقر يقينها في قلوبنا لما هدأت ألسنتنا عن ذكر الله ، ومن لزم ذكر الله تعالى كان له محبا ومعينا ونصيرا .. ذلك هو مفتاح الفوز والسعادة .. هناك من لايذكر الله إلا قليلا ...المسألة يا أعزاء مسألة توفيق ، انظر للذكر إنه من أسهل الطاعات وأعظمها أجرا ، لكن لايوفق له إلا القليل !! ..\n" +
                "من أعظم أسباب الشكر كثرة الذكر ، وبالشكر تدوم النعم ..وبقدر مافي ذكرك لربك من حضور القلب والخشوع ، ينالك ذكرا في السماء .. أنت تذكر الله خاشعا عابدا ، والله يذكرك مؤيدا وحافظا .. عوض تهميشك في الحياة بأن يدوي ذكرك في السماء .. وشتان بين أن يذكرك الخلق في الأرض ، وبين أن يذكرك الخالق في السماء ثم يضع لك القبول في الأرض .. اللهم اجعلنا ممن ينال هذا الشرف ..",""));

        aibar.add(new Douae(1,"الاستغفار نوعٌ من أنواع الدعاء، وحكمه في ذلك حكم الدعاء؛ فالمسلم وهو يستغفر يطلب من ربه -عز وجل- مغفرة ذنوبه، وكلما رافق ذلك الشعورَ بالانكسار والافتقار والتّذلل بين يدي الله تعالى كلمّا كان أرجى لإجابة دعائه، لا سيما إذا تحرّى مواطن الإجابة وأوقاتها.\n" +
                "\n" +
                " الاستغفار سبب في نزول الغيث وبركة المال وإنبات النبات، قال تعالى: ﴿فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا * يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا*وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًاِ﴾  إضافة إلى أنّه سببٌ للإمداد بالقوّة والمنعة، قال تعالى: ﴿وَيا قَومِ استَغفِروا رَبَّكُم ثُمَّ توبوا إِلَيهِ يُرسِلِ السَّماءَ عَلَيكُم مِدرارًا وَيَزِدكُم قُوَّةً إِلى قُوَّتِكُم وَلا تَتَوَلَّوا مُجرِمينَِ﴾",""));
        aibar.add(new Douae(2,"﴿يسبح له من في السموات والأرضِ﴾ ﴿ويسبح الرعد بحمدهِ﴾ ﴿وإن من شيءإلا يسبح بحمدهِ﴾ نظام كوني بأكمله يسبح الله دون فتور أو ملل ، فأين نحن منه ؟! كل الكائنات تسبح الله .. والإنسان وحده هو الذي يغفل عن ذلك ، وهو أجدر وأحوج خلق الله بالتسبيح !! الحرمان ياعزيزي هو أن يلهج كل شيء بالتسبيح وتصمت أنت.\n" +
                "لسنا وحدنا نصطف للصلاة ونسبح بل ﴿والطير صافات كل قد علم صلاته وتسبيحهِ﴾ شهد الله لجميع الطيور أنها تعرف كيف تصلي .. فهل نعرف نحن كيف نصلي ونخشع في صلاتنا حتى يقبلها الله ؟! وفي الحديث ﴿يدخل الجنة أقوام أفئدتهم مثل أفئدة الطيرِ﴾ هي قلوب رقيقة تتوكل على الله.. فهل لنا قلوب كقلوب الطيور ؟..تأمل يرعاك الله",""));
        aibar.add(new Douae(4,"{هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ} [الرحمن : 60]\n" +
                "هل سمعتم بأعظم وأكثر وأكبر من هذا الكرم الإلهي ؟! ... أحسن أيها العبد يحسن إليك الرحمن جل جلاله ... وشتان مابين إحسانك وإحسانه ..." +
                "الإحسان أن تعبد الله كأنك تراه وإن لم تكن تراه فإنه يراك ..فمن أخلص في عبادته نال درجة الإحسان الذي إن استقر في النفس أشرقت الروح ، وامتلأ القلب خيرا ونورا .. ألا تحب أن يغفر الله لك وتكون من المحسنين ؟..\n" +
                "لقد غفر الله ذنوب من سقى الكلب ، فكيف بمن سقى مؤمنا ؟ .. لاتتجاهل أعمال الخير ياعزيزي ، تحرك ، اعمل .. ساعد .. ولا تنتظر الشكر والهدايا ..أحسن عملك لوجه الله الكريم .. فإن جزاء ربك أعظم ... انظر إلى من أحسن تربية ابنه كيف أكرمه الله ببر هذا الإبن ، وربنا شكور يجازي أهل الإحسان بالإحسان .. أحسن فالله يحب المحسنين ..",""));

        aibar.add(new Douae(7,"{وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَّحِيمًا ○ وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُ عَلَىٰ نَفْسِهِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا} [النساء : ١١٠-١١١]\n" +
                "\n" +
                "أصعب الظلم أن تظلم نفسك .. نفسك أمانة عندك ، فلا تظلمها !!\n" +
                "(يجد الله غفورا رحيما) كل من بحث عن الله بالتأكيد سيجده ، سبحان الله ما أقربه !!... آية تفتح باب التوبة على مصراعيه وباب المغفره على سعته فيطمع كل مذنب تائب في العفو والقبول .. مهما اسود ماضيك .. فربك رحيم .. قريب منك ، إنه سبحانه موجود للمغفرة والرحمة حينما يقصده المستغفرون ، هكذا بلا قيد ولاشرط ولا حجاب\n" +
                "(ومن يكسب إثما فإنما يكسبه على نفسه) ليست الخطيئة موروثه في الإسلام ، اطمئن فلن تحاسب إلا بما كسبت يداك .. يقول الله تعالى (ولاتزر وازرة وزر أخرى) هي قاعدة ترسم ميزان العداله الإلهي ..\n" +
                "إذا كان الإنسان من أهل الخير وعمل سيئة يحزن ويلوم نفسه ويقشعر بدنه يستغفر ويعزم ألا يعود إليها .. فهذا يكسب المغفرة ..أما من عمل السيئة وتفاخر بها وغلبه الفجور فقد اكتسب الإثم ، والله عليم حكيم يفتح باب التوبة للذين يطرقونه في كل حين ويلجونه بلا استئذان .. عود نفسك على الاستغفار فإن لله ساعات لايرد فيها أحدا ",""));
        aibar.add(new Douae(8,"{سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى} [الأعلى : 1]\n" +
                "\n" +
                "سبحان ربيَ الأعلى.. سبحان ربيَ العظيم .. لا نقدِّس إلا اسمك .. ولا نتبعُ إلا هداك ..\n" +
                "الأعلى : هو الذي علا فلا تُدرَك ذاته ، ويستحق صفات الجلالة والكبرياء ولا يزيده تعظيم العباد له شيئاً من عُلُوِّه ..سبحانه\n" +
                "كما هو الله العظيم الأعلى في السموات ، فلا بدَّ ان يكون الأعلى في سماء قلوبنا ، وفي كلِّ حياتنا ... نحبُّ معالي الأمور ونكره سِفْسَافَها .. ونهتمُّ بأمر الآخرة لنكسب الدنيا والآخرة ..\n" +
                "الملائكة منذ خلقها الله ساجدة تحت العرش تسبح الله ، ويوم القيامة تقول (سبحانك ربنا ماعبدناك حق عبادتك)\n" +
                "الأعلى يسمعك يا عزيزي ولو كنت في أدنى الأرض اخضع وتذلَّل له في سجودك وإياك ثم إياك أن تتعالى ، أن تتعاظم ، فهذا مقام الألوهيه ، مقام العليّ المعزّ الجبار .. أما أنت فبقدر ماتخضع له وتفتقر إليه يرفعك ..\n" +
                "اللهم هذه جباهنا لك ساجدة وقلوبنا لك خاشعة وألسنتنا لك ذاكره فارحم ضعفنا واغفر لنا وارفع منزلتنا عندك ..",""));
        aibar.add(new Douae(9,"{وَالصُّبْحِ إِذَا تَنَفَّسَ} [التكوير : 18]\n" +
                "\n" +
                "الصباح مولودُ الليلِ الجميل.. يبتسم للدنيا بإشراقة شمسه وينظرُ إلينا بعين الأمل والتفاؤل ولسانُ حالِهِ يقول : ثِقْ بربكَ ولا تقلق ..\n" +
                "في الآية الكريمة تعبير قرآني غاية في الروعة والإبداع ، حيث جعل انبلاج الفجر وانفتاق النهار من الليل وكأنه عودةٌ للروح بعد أن حَبَسَ الليلُ أنفاسه لولادةِ يومٍ جديد .. و يتنفس الصباح بانشراح ، ويسبِّحُ الكونُ باسم الله الخالق العظيم ..\n" +
                "لن يتنفس الصباح إلا بعد اشتداد الظلمة ، والفرج لا يكون إلا بعد اشتداد الكَرب ..\n" +
                "كم في الفجر من فَرَجٍ وتحوُّل من ضيقٍ إلى سعة ، ومن كَدَرٍ إلى هناء ، ومن حزن إلى فرح\n" +
                "وكما يجدّدُ الصبحُ أنفاسه بهذا الكون فلْنُجدد نحن أنفاسنا بنسائم الذكر ، و لنجعل لصباحنا نفساً جميلاً يسرّنا ، لنستنشق الفرح القادم ولِيطِيبَ صباحُنا بأذكار الصباح ..",""));
        aibar.add(new Douae(10,"{... إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ} [التحريم : 11]\n" +
                "\n" +
                "حين تعبت امرأة فرعون من كيد الحياة ومشاقها بالقرب من فرعون ، أيقنت انه لاراحة خالدة إلا في الجنة فدعت ربها دعاء خلده الله في القرآن ..\n" +
                "السيدة آسيا هي من أعظم نساء العالمين الاربعة الذين أخبر عنهم رسول الله صلى الله عليه وسلم ، وقد كان لها أعمالا صالحة كثيرة ، لكن الله ذكرها بالعمل الذي يحبه وهو الدعاء ..\n" +
                "لقد حققت هذه المراة مقاصد الولاء لله بالتقرب إليه ، والبراء من الشرك بالخلاص من فرعون والسلامة من شدته ، وقد سألت ربها أن يرزقها بيتا في الجنة ، وهذا لم يأت من فراغ فإيمانها في ظل الظروف التي كانت تعيش فيها ، في نفس البيت مع عدو الله ، جعلها تستحق هذه المكانة ..\n" +
                "ولم تسأل ربها بيتا في الدنيا بديلا عن بيت فرعون لانها علمت أن كل بيوت الدنيا فانية ، فسعت إلى دار الخلود الابدية ..\n" +
                "اللهم إنا نسألك بيتا في الجنة ..",""));
        aibar.add(new Douae(11,"{۞ وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي ۚ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ} [يوسف : 53]\n" +
                "\n" +
                "آه من النفس إن لم يكن عليها سلطان يأخذ بلجامها .. لن ينال عدوك كما تنال منك نفسك .. أوامرها الرديئة لاتنتهي ، عش معها بنفسية المتمرد الثائر\n" +
                "أول أعداء الإنسان نفسه ، وإن رمى اللوم على غيرها ، فإنها إن لم تحمله إلى الشر أعانته عليه إلا مارحم ربي .. وقد ذم الله النفس في القرآن ومدح العقل ، لأن بلاء العقول من هوى النفوس .. عليك ياعزيزي أن تعترف أنك في حرب مستمره مع نفسك تضبطها فترة ، وتتفلت منك فترة .. تؤلمك حينا ، وتسعدك أحيانا .. هذا هو جهاد النفس\n" +
                "أعلى مراتب الصدق أن تكون صادقا مع نفسك ، بالإمكان ان تخدع الجميع ويصدقونك ، لكن هل تقدر ان تخدع نفسك ؟ إقرارك بالذنب مع انكسارك لله تكسب مغفرته ورحمته ، وإياك والمكابره أو شرعنة الذنب فتلك هي الهاوية . احذر البطاله والفراغ .. إن النفس لاتقعد فارغة فإن لم تشغلها بما ينفعها شغلتك بما يضرك ( قد أفلح من زكاها وقد خاب من دساها) اللهم آت نفوسنا تقواها أنت وليها ومولاها",""));
        aibar.add(new Douae(12,"{قَدْ أَفْلَحَ مَن تَزَكَّىٰ ○ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ} [الأعلى : ١٤- ١٥]\n" +
                "أعظم مايزكي النفوس كثرة ذكر الله مع كثرة الصلاة .. فهي مفاتيح الطهارة القلبية ... صباح الطهر والفلاح ..\n" +
                "هذه الدنيا لاشيء فيها يدوم .. لاقصور ولا أملاك ، والذي ينفعك حقا هو عملك الصالح ، لقد فاز وربح من طهّر نفسه ونقاها من الذنوب وسوء الأخلاق ... ومن أكثر من ذكر الله أقام الله له صلاته ، فالذكر مداد الصلاة .. ومن ذكر الله (خاليا) ففاضت عيناه حرمه الله على النار .. فتش عن (الخلوة مع الله) ياعزيزي فربما تلتقي بدمعتك الخالدة ..\n" +
                "تزكية النفس وتصفيتها من شوائب الغفلة ، من أعظم سنن الحياة ودليل ذلك أن الله تعالى أقسم أحد عشر قسماً قال بعدها (قد أفلح من زكاها) [سورة الشمس] ألا ينبغي لنا بعد ذلك أن نتقي الله ونلتزم الطريق المستقيم ونوجه قلوبنا لمن بيده الخلق والأمر ؟. اجتهد ياعزيزي في قطف ثمرة فلاحك من خلال تزكية نفسك ، وإن لم تفعل فقد قال الله تعالى (وقد خاب من دساها) اللهم سلم .. اللهم لاتجعلنا من الخائبين ..",""));
        aibar.add(new Douae(13,"{فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا ○ يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا} [نوح:١٠-١١]\n" +
                "حين نعتذر عن أخطائنا للناس نحتاج أن نعتذر لكل خطأ بعينه، وأن نفكر كيف نقنعهم بمبرراتنا... أما مع الله تعالى فيكفيك عبارة (أستغفر الله)\n" +
                "كلما تكررت توبة العبد واستغفاره، كلما تكررت مغفرة الله لذنوبه وأخطائه. داؤنا ياأعزاء هي الذنوب ودواؤنا هو الإستغفار ، والله يغفر الذنوب جميعا مهما كانت كبيره فقط استغفر... هكذا علمنا القرآن ، وإذا لم تنجح في الإقلاع عن الذنب ، فلا تقلع عن الإستغفار.\n" +
                "انظروا ماذا يفعل الإستغفار {يرسل السماء عليكم مدرارا. ويمددكم بأموال وبنين ويجعل لكم جنات و يجعل لكم أنهارا} تعددت الخيرات والسبب واحد هو (الإستغفار) الذي يفتح أبواب السماء ويفرج الهم والغم ويدفع البلاء.. وعند الإصرار على الكفر تأتي آية الترهيب {مالكم لاترجون لله وقارا} آية تهز القلوب أن أفيقوا من غفلتكم.. إن الله العظيم يراكم فاتقوه...",""));
        aibar.add(new Douae(14,"{وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ} [البقرة : 45]\n" +
                "\n" +
                "من خير الوصايا لمن أراد الخير لنفسه ولغيره .. فمن حافظ على الصلاة صلح حاله وطهر قلبه .. تأمل معي (إن الصلاة تنهى عن الفحشاء والمنكر)\n" +
                "لم يأمرنا الله تعالى بالصبر إلا أن ماقدره (ممكن التحمل) اصبر ... فالصبر زاد لكنه قد ينفد لذا أمرنا الله أن نستعين بالصلاة الخاشعة لتمد الصبر وتقويه ، وبالخشوع تهون كل عظيمه .. كثيرا مانوصي من أصيب بمصيبة (بالصبر) لكن لماذا لانوصيه أيضا بقرينة الصبر وهي (الصلاة) ؟؟ .. لقول الله تعالى(واستعينوا بالصبر والصلاة) وقد كان رسولنا صلى الله عليه وسلم إذا حزبه أمر فزع إلى الصلاة ..\n" +
                "الصلاة ثقيلة على من لم يخشع فيها ، والخشوع ثقيل على ضعيف اليقين بلقاء الله .. قف في مصلاك ياعزيزي واعلم أنك بين يدي الله العظيم ، تدبر ماتقرأ من الآيات ، اسجد وتذلل لله .. اخشع وتلذذ بالصلاة وتذوق حلاوتها .. فالصلاة تعينك على الارتفاع ، والصبر يعينك على عدم الهبوط ..",""));


        Intent intent = getIntent();
        String time = intent.getStringExtra("time");
        if (time.equals("sabah")){
            adapter.setDouaeList(sobhDouaes);
        } else if (time.equals("masae")) {
            adapter.setDouaeList(masaDouaes);
        } else if (time.equals("nawm")) {
            adapter.setDouaeList(nawmDouaes);
        }else if (time.equals("salat")) {
            adapter.setDouaeList(salatDouaes);
        }else {
            adapter.setDouaeList(aibar);
        }

    }

}